<?php
return [
    /*
    |--------------------------------------------------------------------------
    | 请求语言包
    |--------------------------------------------------------------------------
    |
    |
    */
    'user' => [
        'name' => '用户名',
        'email' => '邮箱',
        'cellphone' => '手机号',
        'password' => '密码',
        'portrait' => '头像',
    ],
    'role' => [
        'roles' => '角色别名',
        'introduction' => '角色名称',
    ],
    'power' => [
        'title' => '权限名称',
        'api' => '权限别名',
    ]
];
