<?php

return [

    /*
    |--------------------------------------------------------------------------
    | DSWJCMS个性化配置
    |--------------------------------------------------------------------------
    */

    /*
    |--------------------------------------------------------------------------
    | Homestead windows
    |--------------------------------------------------------------------------
    |
    |  windows下搭建的Homestead，因软链接无法使用，故进行了特别处理
    |
    */

    'homestead' => env('HOMESTEAD_WINDOWS', false),
    'failuretime'=> time()+5*60, // 失效时间
    'versions'=> env('API_VERSIONS',1),   //当前版本
    'applySecret'=> env('APP_KEY', ''), //API密钥串
];
